# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
s1 = pd.Series(np.random.randint(1,5,100))
s2 = pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,30001,100))

In [6]:
s1

0     1
1     3
2     2
3     4
4     2
     ..
95    2
96    3
97    3
98    1
99    1
Length: 100, dtype: int64

In [7]:
s2

0     3
1     2
2     3
3     1
4     2
     ..
95    3
96    2
97    1
98    3
99    3
Length: 100, dtype: int64

In [8]:
s3

0     11913
1     14448
2     25317
3     18382
4     10481
      ...
95    12637
96    26938
97    26364
98    20671
99    27240
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.DataFrame([s1, s2, s3]).T
df

    0  1      2
0   1  3  11913
1   3  2  14448
2   2  3  25317
3   4  1  18382
4   2  2  10481
.. .. ..    ...
95  2  3  12637
96  3  2  26938
97  3  1  26364
98  1  3  20671
99  1  3  27240

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       1       3            11913
1       3       2            14448
2       2       3            25317
3       4       1            18382
4       2       2            10481
..    ...     ...              ...
95      2       3            12637
96      3       2            26938
97      3       1            26364
98      1       3            20671
99      1       3            27240

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [17]:
bigcolumn =pd.concat([s1,s2,s3])

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [18]:
bigcolumn

0         1
1         3
2         2
3         4
4         2
      ...
95    12637
96    26938
97    26364
98    20671
99    27240
Length: 300, dtype: int64

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
bigcolumn.reset_index(drop = True)

0          1
1          3
2          2
3          4
4          2
       ...
295    12637
296    26938
297    26364
298    20671
299    27240
Length: 300, dtype: int64